In [2]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('member.txt')
df.head()

    name        class  gender  age
0   John  Mathematics    male   18
1   Liam   E-Business  female   19
2   Noah  Mathematics  female   20
3  Logan     Computer    male   20
4  Lucas   E-Business    male   21

In [7]:
group_gender = df.groupby('gender')
group_gender.groups

{'female': Int64Index([1, 2, 6, 8, 9], dtype='int64'),
 'male': Int64Index([0, 3, 4, 5, 7, 10, 11, 12, 13, 14, 15], dtype='int64')}

In [8]:
len(group_gender)

2

In [9]:
group_gender.size()

gender
female     5
male      11
dtype: int64

In [10]:
gender_cnt = pd.DataFrame({'count':group_gender.size()}).reset_index()
gender_cnt

   gender  count
0  female      5
1    male     11

In [11]:
for name, group in group_gender:
    print(name, ':', str(len(group)))
    print(group)
    print()

female : 5
     name        class  gender  age
1    Liam   E-Business  female   19
2    Noah  Mathematics  female   20
6  Oliver   E-Business  female   21
8  Elijah     Computer  female   22
9   Aiden   Accounting  female   22

male : 11
      name        class gender  age
0     John  Mathematics   male   18
3    Logan     Computer   male   20
4    Lucas   E-Business   male   21
5    Mason   E-Business   male   21
7    Ethan     Computer   male   22
10   James     Computer   male   22
11  Sophia      Finance   male   23
12    Emma   Accounting   male   23
13   Emily      Finance   male   23
14   Grace     Computer   male   23
15  Hailey      Finance   male   23

In [14]:
# class 에 대해서 groupby 적용
group_class = df.groupby('class')

In [15]:
len(group_class)

5

In [16]:
for name, group in group_class:
    print(name, ':', str(len(group)))

Accounting : 2
Computer : 5
E-Business : 4
Finance : 3
Mathematics : 2

In [17]:
class_cnt = pd.DataFrame({'count': group_class.size()}).reset_index()
class_cnt

         class  count
0   Accounting      2
1     Computer      5
2   E-Business      4
3      Finance      3
4  Mathematics      2

In [18]:
group_mulit = df.groupby(['class', 'gender'])
group_mulit.size()

class        gender
Accounting   female    1
             male      1
Computer     female    1
             male      4
E-Business   female    2
             male      2
Finance      male      3
Mathematics  female    1
             male      1
dtype: int64

In [20]:
pd.DataFrame({'count': group_mulit.size()}).reset_index()

         class  gender  count
0   Accounting  female      1
1   Accounting    male      1
2     Computer  female      1
3     Computer    male      4
4   E-Business  female      2
5   E-Business    male      2
6      Finance    male      3
7  Mathematics  female      1
8  Mathematics    male      1

In [21]:
# Quiz

In [25]:
import pandas as pd
df = pd.read_csv('emp.txt')

In [26]:
# Q1
group_job = df.groupby('job')
group_job.size()

job
analyst      2
clerk        4
manager      3
president    1
salesman     4
dtype: int64

In [27]:
pd.DataFrame({'count':group_job.size()}).reset_index()

         job  count
0    analyst      2
1      clerk      4
2    manager      3
3  president      1
4   salesman      4

In [29]:
group_job_deptno = df.groupby(['deptno', 'job'])
group_job_deptno.size()

deptno  job
10      clerk        1
        manager      1
        president    1
20      analyst      2
        clerk        2
        manager      1
30      clerk        1
        manager      1
        salesman     4
dtype: int64

In [32]:
df2 = pd.DataFrame({'인원': group_job_deptno.size()}).reset_index()
df2.columns = ['부서번호', '직무',' 인원']
df2

   부서번호         직무   인원
0    10      clerk    1
1    10    manager    1
2    10  president    1
3    20    analyst    2
4    20      clerk    2
5    20    manager    1
6    30      clerk    1
7    30    manager    1
8    30   salesman    4

04_02_data.csv

In [34]:
df3 = pd.read_csv('04_02_data.csv', nrows=10)
df3

  지역명               규모구분    연도   월  분양가격(㎡)
0  서울                 전체  2015  10     5841
1  서울         전용면적 60㎡이하  2015  10     5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10     5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10     5721
4  서울        전용면적 102㎡초과  2015  10     5879
5  인천                 전체  2015  10     3163
6  인천         전용면적 60㎡이하  2015  10     3488
7  인천   전용면적 60㎡초과 85㎡이하  2015  10     3119
8  인천  전용면적 85㎡초과 102㎡이하  2015  10     3545
9  인천        전용면적 102㎡초과  2015  10     3408